[
  {
    "title": "Over 34,000 Missouri Students Lacked Stable Housing Last School Year—Here’s Why That Matters ",
    "link": "https://www.primecenter.org/prime-blog/stable-housing",
    "pubDate": "Wed, 02 Jul 2025 13:00:00 +0000",
    "description": "In Missouri, student homelessness is not just a growing crisis—it’s an \r\nurgent education policy issue. According to our new report, more than \r\n34,000 students in Missouri’s public schools were identified as \r\nexperiencing homelessness during the 2022–23 academic year. That’s 1 in \r\nevery 25 students, far higher than the national average. While Missouri \r\nmakes up just 1.8% of the U.S. population, it accounts for 2.5% of all \r\nstudents identified as homeless nationwide—an overrepresentation that \r\ndemands serious attention.",
    "thumbnail": ""
  },
  {
    "title": "Examining the Mentoring Experiences of First-Year Teachers in Missouri",
    "link": "https://www.primecenter.org/prime-blog/mentoring",
    "pubDate": "Tue, 01 Jul 2025 14:26:46 +0000",
    "description": "The US Department of Education released a report yesterday by, among others \r\nat the Regional Education Laboratory (REL) Central, PRiME’s own Kathryn \r\nColeman, Collin Hitt, and Saint Louis University School of Education Dean, \r\nGary Ritter. \r\n\r\nThe report examined features of early-career teacher mentoring for the \r\npurposes of understanding its effects on teacher retention within schools. \r\nThe study was requested by the Missouri Department of Elementary and \r\nSecondary Education (MO DESE) toward the goal of improving teacher \r\nretention in Missouri.\r\n\r\nThe study found that more than half of first-year teachers met with their \r\nmentors multiple times per month, but the amount of time and specific \r\nactivities of the meetings varied widely.\r\n\r\nTo read more, find the full report here.",
    "thumbnail": ""
  },
  {
    "title": "A Tale of Two Tests",
    "link": "https://www.primecenter.org/prime-blog/two-tests",
    "pubDate": "Fri, 27 Jun 2025 13:00:00 +0000",
    "description": "When it comes to student achievement in Missouri, the story depends on \r\nwhich test you’re reading. Since the COVID-19 pandemic, Missouri \r\nstudents—like students across the country—have faced significant academic \r\nchallenges. The National Assessment of Educational Progress (NAEP), often \r\nreferred to as the \"Nation’s Report Card,\" tells us that reading and math \r\nscores in Missouri have dropped dramatically for both 4th and 8th graders. \r\nBut a look at the state’s own MAP (Missouri Assessment Program) test \r\nresults paints a different picture: only slight declines, and in some \r\ncases, no decline at all.",
    "thumbnail": ""
  },
  {
    "title": "PRiME in the News: PRiME Growth Scores Featured in STL Magazine",
    "link": "https://www.primecenter.org/prime-in-the-news/blog-post-title-four-2edl2",
    "pubDate": "Tue, 24 Jun 2025 20:05:00 +0000",
    "description": "Each year, Missouri gives standardized tests to all public school kids \r\ngrades 3 through 8 to gauge their proficiency in math and English. In the \r\n2023–2024 school year, only a tenth of KIPP Wonder’s kids who took the \r\ntests scored “proficient” in English. That’s 31 points below the state \r\naverage. But it’s just a snapshot—and, in large part, due to factors \r\noutside any school’s control, such as community and family resources. \r\nMissouri also calculates a growth metric, one that Collin Hitt, the \r\nexecutive director of Saint Louis University’s education policy group, \r\nPRiME Center, calls “the best in the country.” It asks the question: How \r\nfar did students move forward in a subject, regardless of where they \r\nstarted, and in comparison to other similarly situated students? And on \r\nthat metric, KIPP Wonder showed the second largest average leap in English \r\nof all public elementary schools in Missouri, according to a PRiME analysis\r\n. (They were second only to a school in the Ozarks.)",
    "thumbnail": ""
  },
  {
    "title": "PRiME in the News: PRiME Growth Scores Featured in STL Magazine",
    "link": "https://www.primecenter.org/prime-blog/growth-stlmag",
    "pubDate": "Tue, 24 Jun 2025 16:26:48 +0000",
    "description": "Each year, Missouri gives standardized tests to all public school kids \r\ngrades 3 through 8 to gauge their proficiency in math and English. In the \r\n2023–2024 school year, only a tenth of KIPP Wonder’s kids who took the \r\ntests scored “proficient” in English. That’s 31 points below the state \r\naverage. But it’s just a snapshot—and, in large part, due to factors \r\noutside any school’s control, such as community and family resources. \r\nMissouri also calculates a growth metric, one that Collin Hitt, the \r\nexecutive director of Saint Louis University’s education policy group, \r\nPRiME Center, calls “the best in the country.” It asks the question: How \r\nfar did students move forward in a subject, regardless of where they \r\nstarted, and in comparison to other similarly situated students? And on \r\nthat metric, KIPP Wonder showed the second largest average leap in English \r\nof all public elementary schools in Missouri, according to a PRiME analysis\r\n. (They were second only to a school in the Ozarks.)",
    "thumbnail": ""
  },
  {
    "title": "Charter Schools: Public Opinion in Missouri",
    "link": "https://www.primecenter.org/prime-blog/charter-schools",
    "pubDate": "Mon, 23 Jun 2025 16:17:06 +0000",
    "description": "Missouri is home to 37 Charter Local Education Agencies (LEAs)—20 in Kansas \r\nCity and 17 in St. Louis. In 2024, Missouri charter schools educated around \r\n25,000 students. Charter schools are public schools, free from tuition and \r\nfees, that operate in the St. Louis and Kansas City areas of Missouri. \r\nCharter schools are sponsored or “authorized” not by the state, but rather \r\nby an entity that grants a charter and provides accountability. There are \r\ncurrently seven charter school sponsors in Missouri—Saint Louis University \r\nis one of them. More information about Missouri charter schools can be \r\nfound at https://dese.mo.gov/quality-schools/charter-schools.",
    "thumbnail": ""
  },
  {
    "title": "What does it mean to be ‘rural?’",
    "link": "https://www.primecenter.org/prime-blog/rurality",
    "pubDate": "Wed, 11 Jun 2025 18:53:06 +0000",
    "description": "The definition of rural varies depending on the source. In today’s blog \r\npost, we discuss common definitions of “rural,” when they are best used, \r\nand why picking the right definition matters.",
    "thumbnail": ""
  },
  {
    "title": "Technology in the Classroom: Missouri Voter Preferences",
    "link": "https://www.primecenter.org/prime-blog/technology-in-the-classroom",
    "pubDate": "Fri, 16 May 2025 14:38:03 +0000",
    "description": "In 2022, 95% of teens reported having access to a smartphone, a more than \r\n20 percentage point increase from 2014–15 (73%). According to the National \r\nEducation Association (NEA), these devices are taking a toll on students’ \r\nmental health as well as their ability to focus in class. Consequently, 15 \r\nstates have already passed laws or enacted policies that ban or restrict \r\nthe use of cell phones in schools statewide and Missouri lawmakers are \r\nconsidering following suit. When surveyed last Fall (2024), a large \r\nmajority of Missouri voters reported support for prohibiting high school \r\nstudents from accessing their cell phones both during regular school hours \r\n(72%) and during class (79%).",
    "thumbnail": ""
  },
  {
    "title": "Missourians Want to Pay Their Teachers More",
    "link": "https://www.primecenter.org/prime-blog/missouri-wants-to-pay-their-teachers-more",
    "pubDate": "Fri, 09 May 2025 19:47:12 +0000",
    "description": "The average starting teacher salary in Missouri in FY 2022–23 was $36,829, \r\nwhich ranked 50th in the nation. In June 2020 and August 2023, we asked \r\nvoters if they believe public school teacher salaries should increase, \r\ndecrease, or stay the same. In 2020, almost three quarters of respondents \r\n(74%) claimed salaries should increase, and this response increased to 81% \r\nby August 2023",
    "thumbnail": ""
  },
  {
    "title": "Toys for Textbooks: At What Age Are Children Required to Attend School in Missouri?",
    "link": "https://www.primecenter.org/prime-blog/compulsory-schooling",
    "pubDate": "Fri, 02 May 2025 17:50:30 +0000",
    "description": "A recent poll suggests that Missourians across party, age, and education \r\nlines favor requiring all six-year-olds to attend school. Missouri—along \r\nwith 14 other states—does not require this.",
    "thumbnail": ""
  },
  {
    "title": "Cell Phone Bans in Schools: Is Missouri Next?",
    "link": "https://www.primecenter.org/prime-blog/cell-phones",
    "pubDate": "Fri, 11 Apr 2025 17:23:59 +0000",
    "description": "This week in neighboring Illinois, a bill to ban cell phones from \r\nclassrooms unanimously passed in the Senate. The bill, advocated for by \r\nIllinois’ Governor J.B. Pritzker, now moves to the House. If passed, they \r\nwould join the more than 40% of states who have laws or policies \r\nrestricting cell phone use in schools. Missouri has similar legislation in \r\nthe works, and voters are in support.",
    "thumbnail": ""
  },
  {
    "title": "Urban Renewal’s Educational Legacy: Black Displacement and School Segregation from Mill Creek to Pruitt-Igoe ",
    "link": "https://www.primecenter.org/prime-blog/urban-renewal-in-education",
    "pubDate": "Fri, 04 Apr 2025 17:29:31 +0000",
    "description": "This research was presented at the Mapping Spaces, Embodying Territories \r\n2025 Conference at Saint Louis University on April 4, 2025.",
    "thumbnail": ""
  },
  {
    "title": "A PRiMER On Free and Reduced-Price Lunch",
    "link": "https://www.primecenter.org/prime-blog/frl",
    "pubDate": "Fri, 28 Mar 2025 14:49:33 +0000",
    "description": "Free and Reduced-Price Lunch (FRL) can be a bit of a buzzword in the \r\neducation space. In today’s blog post, we dispel common misconceptions \r\nabout the program, and answer some FAQs.",
    "thumbnail": ""
  },
  {
    "title": "Missouri Voters Oppose the Elimination of The Department of Education",
    "link": "https://www.primecenter.org/prime-blog/doe",
    "pubDate": "Fri, 21 Mar 2025 20:29:57 +0000",
    "description": "For years, President Donald Trump has campaigned on, among other things, \r\nhis intentions to dissolve the Department of Education. In January 2025, \r\ntwo bills seeking to do just that, were introduced in the House of \r\nRepresentatives (H.R.369 and H.R.899). Just yesterday, Trump signed an \r\nexecutive order that would begin eliminating the federal Department of \r\nEducation, citing poor test scores as a key justification for the move.",
    "thumbnail": ""
  },
  {
    "title": "Empty Desks: Key Trends In Chronic Absenteeism in Missouri Schools",
    "link": "https://www.primecenter.org/prime-blog/empty-desks",
    "pubDate": "Fri, 21 Mar 2025 17:24:03 +0000",
    "description": "The newest data from the Department of Elementary and Secondary Education \r\nfinds that more than one in five K–12 students were chronically absent in \r\nthe 2023–24 school year. From 2019 to 2024, nearly 91% of Missouri \r\ndistricts (499 total) have experienced a rise in chronic \r\nabsenteeism—defined as missing at least ten percent of scheduled school \r\ndays. Here, we explore key trends from the most recent Missouri attendance \r\ndata.",
    "thumbnail": ""
  },
  {
    "title": "Time Change or Time for Change: Missouri Voters Want Later High School Start Times",
    "link": "https://www.primecenter.org/prime-blog/time-change",
    "pubDate": "Thu, 20 Mar 2025 14:59:44 +0000",
    "description": "The results are in: Missouri voters want later high school start times.",
    "thumbnail": ""
  },
  {
    "title": "Head Count: Enrollment over Time across Missouri, KC Metro and STL Metro",
    "link": "https://www.primecenter.org/prime-blog/enrollment",
    "pubDate": "Fri, 14 Mar 2025 14:56:11 +0000",
    "description": "Over the last decade, charter schools in Kansas City and St. Louis metro \r\nareas have grown, while traditional public school enrollment has generally \r\ndeclined. However, preliminary data for the 2024-25 school year suggests \r\nthat some of these trends may be shifting.",
    "thumbnail": ""
  },
  {
    "title": "Community Schools in St. Louis: A Brief History",
    "link": "https://www.primecenter.org/prime-blog/community-schools",
    "pubDate": "Fri, 07 Mar 2025 21:59:46 +0000",
    "description": "Community schools are commonly defined as physical and relational hubs for \r\npartnerships between the school and community to support student, family, \r\nand community well-being (Oakes et al., 2017). These schools are expanding \r\nnationwide to improve equity and student success. St. Louis has \r\nexperimented with community schools since the 1960s, with various \r\niterations such as Community Education Centers and Full-Service Schools. \r\nMany initiatives faced funding shortages, leadership instability, or \r\nexternal disruptions, highlighting the need for sustainable implementation \r\nstrategies.",
    "thumbnail": ""
  },
  {
    "title": "Chronic Absenteeism in Missouri Schools",
    "link": "https://www.primecenter.org/prime-blog/chronic-absenteeism",
    "pubDate": "Sat, 01 Mar 2025 01:30:00 +0000",
    "description": "Each year, the Missouri Department of Elementary and Secondary Education \r\nprovides data on the attendance rates of Missouri students. Here, we \r\nprovide a brief overview of chronic absenteeism and updated attendance \r\nrates in Missouri in advance of our forthcoming policy brief. We also debut \r\nPRiME’s interactive maps, this one detailing the most recent proportional \r\nattendance rates by district.",
    "thumbnail": ""
  },
  {
    "title": "Students Experiencing Homelessness",
    "link": "https://www.primecenter.org/prime-blog/homelessness",
    "pubDate": "Fri, 21 Feb 2025 13:00:00 +0000",
    "description": "With children making up roughly one-fifth of the homeless population, \r\neducation policy must address support and resources for these students and \r\nfor schools. In this blog post, we explore the data on students \r\nexperiencing homelessness in Missouri.",
    "thumbnail": ""
  },
  {
    "title": "Missouri’s School Funding Formula",
    "link": "https://www.primecenter.org/prime-blog/funding",
    "pubDate": "Mon, 10 Feb 2025 16:19:04 +0000",
    "description": "To calculate school funding, Missouri currently uses a model that estimates \r\nthe cost of adequately educating a child and subtracts out what can be \r\nraised locally through taxes to arrive at the total aid provided to a \r\nschool. The current model was developed nearly 20 years ago in 2005. There \r\nis contention with a few key pieces of the funding formula, some of which \r\nwere addressed this year with the passage of Senate Bill 727, and some that \r\npersist.",
    "thumbnail": ""
  }
]