[
  {
    "title": "PRiME Growth Report: Special Edition",
    "link": "https://www.primecenter.org/prime-blog/3-year-growth",
    "pubDate": "Fri, 25 Jul 2025 13:00:00 +0000",
    "description": "Since 2019 the PRiME Center has issued reports that feature the highest \r\ngrowth schools in Missouri, translating state growth data into a scale that \r\nparents, educators and policymakers can use. Our recent Special Edition of \r\nthe PRiME Growth Report Series examines the average PRiME Growth Scores of \r\nschools since COVID, over the three periods where we have full data: the \r\n2021–22, 2022–23, and 2023–24 school years.",
    "thumbnail": "http://static1.squarespace.com/static/5c8a78c9e5f7d15aab22c61c/5c8feec34785d3d4957fbc9b/68825d7e60ba9c0a61c59a83/1753448453651/Screenshot+2025-07-24+112829.png?format=1500w"
  },
  {
    "title": "Statewide Ban on Cell Phones in Missouri Schools: What Does It Mean, Who is Affected, and How Do Missouri Voters Feel About it?",
    "link": "https://www.primecenter.org/prime-blog/sb68",
    "pubDate": "Fri, 25 Jul 2025 13:00:00 +0000",
    "description": "On July 9, 2025, Missouri Governor Mike Kehoe signed Senate Bill 68 into \r\nlaw, enacting a statewide ban on electronic communication devices in \r\nMissouri public and charter schools beginning with the 2025–26 academic \r\nyear. This bill comes in response to growing concerns among Missourians \r\nabout technology in the classroom and reflects a broader desire to promote \r\neducational attainment, safety, and effective working environments for \r\nemployees in Missouri schools.",
    "thumbnail": "http://static1.squarespace.com/static/5c8a78c9e5f7d15aab22c61c/5c8feec34785d3d4957fbc9b/688257392b8e7e3bbe04feef/1753448453638/Screenshot+2025-07-23+123227.png?format=1500w"
  },
  {
    "title": "Academic Growth in Rural Schools: A Special Edition of PRiME’s Growth Reports",
    "link": "https://www.primecenter.org/prime-blog/rural-growth",
    "pubDate": "Tue, 22 Jul 2025 19:06:34 +0000",
    "description": "When we talk about how students are doing in subjects like reading and \r\nmath, it’s more helpful to look at how much they grow over time rather than \r\njust where they stand at one moment. This report continues the PRiME \r\nCenter’s efforts to highlight Missouri’s excellent schools by examining \r\nstudent growth in the state's most rural schools over the last three years.",
    "thumbnail": "http://static1.squarespace.com/static/5c8a78c9e5f7d15aab22c61c/5c8feec34785d3d4957fbc9b/686ec3a3037414598f2d2e89/1753374078306/Screenshot+2025-07-22+140339.png?format=1500w"
  },
  {
    "title": "Reflections from a Charter School Trailblazer: Collin Hitt and Kelly Garrett sit down to discuss Garrett’s 14 years of leadership at KIPP St. Louis",
    "link": "https://www.primecenter.org/prime-in-the-news/kelly-garrett",
    "pubDate": "Tue, 22 Jul 2025 17:29:53 +0000",
    "description": "Reflections from a Charter School Trailblazer: Collin Hitt and Kelly \r\nGarrett sit down to discuss Garrett’s 14 years of leadership at KIPP St. \r\nLouis",
    "thumbnail": "http://static1.squarespace.com/static/5c8a78c9e5f7d15aab22c61c/686552cc65ab287e04ea3ff1/687919f23a07a43f920699ad/1753205393862/Screenshot+2025-07-17+104932.png?format=1500w"
  }
]