[
  {
    "title": "Artificial Intelligence (AI) in Missouri Schools",
    "link": "https://www.primecenter.org/prime-blog/missouri-ai",
    "pubDate": "Tue, 30 Sep 2025 15:40:23 +0000",
    "description": "The use of Artificial Intelligence is on the rise in classrooms across the \r\ncountry, and while some districts have begun implementing guidelines and \r\nintegrating AI tools into their schools, Missouri does not yet have a \r\nformal policy in place.",
    "thumbnail": "http://static1.squarespace.com/static/5c8a78c9e5f7d15aab22c61c/5c8feec34785d3d4957fbc9b/68c2e3f0ede44217160641d0/1759246823366/20250212-AI-Brain-Glow-MP-2-1260x840-1-4029455564.jpg?format=1500w"
  },
  {
    "title": "School Quality Polling Blog",
    "link": "https://www.primecenter.org/prime-blog/school-qualityu",
    "pubDate": "Tue, 30 Sep 2025 15:39:42 +0000",
    "description": "By : Abigail Medler\nPublished On: September 30, 2025\nSince 2020, Saint Louis University (SLU) and YouGov have worked together to survey Missouri likely voters on relevant educational and political issues. Over the last five years, there have been nine survey waves which, when combined, make up a sample of 7,280 total respondents. \nSome questions remained consistent across polls which allowed for the comparison of their results across time. Through this, the author was able to analyze likely Missouri voters’ opinions on local and state schools, as well as break down the findings by ideology and geographical location.\nWhen asked their opinions of local and Missouri schools, the majority of respondents (55%) rated them identically. However, where opinions did diverge, local schools were favored. Around 28% of Missouri voters view their local schools as better than those of the state. By contrast, fewer than 9% assign a worse rating to their local schools than to the state overall. The imbalance shows that, while most people see no difference, those who do are roughly three times more likely to see their local schools as better.\nWhen these results are broken down by political ideology, the differences are modest but notable. For this variable, respondents were asked to self-identify as one of the following: Very Liberal, Liberal, Moderate, Conservative, Very Conservative, or Not Sure. Very liberal and liberal respondents were more likely to say their local schools are better than the state’s schools—about 34–35% did so—while conservatives and very conservatives did so at about 23–24%. Moderates fell in the middle, with roughly 28% viewing local schools as superior. Across all ideological groups, roughly half of respondents saw no difference between local and statewide schools. Across ideological groups, “Fair” remained the most frequent rating for statewide schools, while “Good” was the most frequent rating for local schools.\nIn order to create a geographical breakdown of the findings, respondents were grouped into six regions: Northeast, Northwest, Southeast, Southwest, and the Kansas City and St. Louis metro areas. In most regions, about one-quarter of respondents said their local schools were better, with a majority (at least 52%) rating local and Missouri schools equally.\nKansas City voters, however, rated their local schools lower than residents elsewhere, though they viewed them as roughly on par with Missouri’s schools overall. \nSt. Louis City rated their own schools substantially worse than St. Louis County and the state overall. In St. Louis City, half of respondents (50.2%) rated the local schools as poor and only 2.6% as excellent. By contrast, in St. Louis County, the ratings skewed far more positively: 11.8% rated their schools as “Excellent” and 36% as “Good,” for a combined 48% giving positive evaluations. Only 20% rated their local schools as “Poor,” less than half the share in the city. \nOverall, St. Louis residents assess all Missouri schools at roughly the same rates as the rest of the state, however, they find their local schools to be of much worse quality than most Missouri voters. This is a notable inversion of the positive local bias trend in quality perceptions. These patterns explain why St. Louis City emerges as an outlier: the concentration of “Poor” ratings for local schools is unmatched anywhere else in the state.\nMORE FROM THE PRiME BLOGS",
    "thumbnail": "http://static1.squarespace.com/static/5c8a78c9e5f7d15aab22c61c/5c8feec34785d3d4957fbc9b/68d2bba6617cd7690222cd91/1759246794698/Screenshot+2025-09-23+102952.png?format=1500w"
  },
  {
    "title": "NEW: Expanded Analysis of High School Start Times in Missouri",
    "link": "https://www.primecenter.org/prime-blog/high-school-start-times",
    "pubDate": "Wed, 06 Aug 2025 15:52:29 +0000",
    "description": "The PRiME Center provides an updated analysis of high school start times \r\nacross the state of Missouri.",
    "thumbnail": "http://static1.squarespace.com/static/5c8a78c9e5f7d15aab22c61c/5c8feec34785d3d4957fbc9b/68936fb9f533730ce8c555a6/1754496002331/Screenshot+2025-08-06+102902.png?format=1500w"
  },
  {
    "title": "PRiME Growth Report: Special Edition",
    "link": "https://www.primecenter.org/prime-blog/3-year-growth",
    "pubDate": "Fri, 25 Jul 2025 13:00:00 +0000",
    "description": "Since 2019 the PRiME Center has issued reports that feature the highest \r\ngrowth schools in Missouri, translating state growth data into a scale that \r\nparents, educators and policymakers can use. Our recent Special Edition of \r\nthe PRiME Growth Report Series examines the average PRiME Growth Scores of \r\nschools since COVID, over the three periods where we have full data: the \r\n2021–22, 2022–23, and 2023–24 school years.",
    "thumbnail": "http://static1.squarespace.com/static/5c8a78c9e5f7d15aab22c61c/5c8feec34785d3d4957fbc9b/68825d7e60ba9c0a61c59a83/1754492857068/Screenshot+2025-07-24+112829.png?format=1500w"
  }
]